/* Ch01-1. 자료구조와 알고리즘은 왜 중요할까? */

/*
  자료 구조와 알고리즘이란 ?

  요리를 비유해서 보면
  재료는 data / 도구는 자료구조 / 레시피는 알고리즘 으로 볼 수 있다.
  결과물인 요리는 software라고 할 수 잇고 요리를 먹는 손님은 client가 될 수 있는것

  결국 크게 나누어서 보면
  자료구조 + 알고리즘 = 프로그램 이 된다

  * 자료구조
  자료구조는 메모리를 효율적으로 사용하며 빠르고 안정적으로 데이터를 처리하는것이 목표이다
  특정 구조를 이루고 있다.

  - Stack
  - Queue
  - Graph
  - Tree

  * 알고리즘 

  특정 문제를 효율적으로 빠르게 해결하는 것이 목표로
  정해진 일련의 절차나 공식화한 형태로 표현한 것을 말한다

  - Binary Search (이진탐색)
  - Shortest Path (최단거리찾기)
  ...

  문제 해결 능력에는 3가지정도가 중요하다

  - 논리적 사고
  해결방법의 절차가 말이 되는가? 

  - 전산화 능력
  현실에 있는것을 software 세계로 능력하는 법
  논리를 조합하여 컴퓨터적인 사고가 가능한가?

  - 엣지 케이스 탐색
  예외 상황을 얼마나 잘 찾는가?

  지금도 최단거리 알고리즘으로 많이 쓰이는
  Dijkstra Algorithm은 1956년에 만들어졌는데 
  아직까지도 잘 사용한다.
  그만큼 알아두면 오랫동안 잘 유용하게 사용할것이다

*/